## Pandas Essentials

In [1]:
import pandas as pd
import numpy as np

# Create a random flights data CSV file
np.random.seed(0)
num_records = 100

AIRLINES = [
    "PIA",
    "Qatar Airways",
    "Emirates",
    "Japan Airways",
    "American Airline",
    "Tata Airline",
    "Saudi Airline",
]

CITIES = [
    "Dubai",
    "Delhi",
    "Karachi",
    "Riyadh",
    "Mecca",
    "Medina",
    "Kuwait",
    "Lahore",
    "Colombo",
    "Dhaka",
    "Sharjah",
    "Mumbai",
    "Auckland",
    "Alaska",
    "San Francisco",
    "Washington",
]

## Creating a random DataFrame

In [2]:
flights_data = {
    "FlightID": np.arange(1, num_records + 1),
    "Airline": np.random.choice(AIRLINES, num_records),
    "Destination": np.random.choice(CITIES, num_records),
    "Duration": np.random.randint(60, 360, num_records),  # Duration in minutes
    "Delay": np.random.randint(0, 120, num_records),  # Delay in minutes
}

df = pd.DataFrame(flights_data)
df.to_csv("random_flights_data.csv", index=False)

In [3]:
# Read the CSV file using pandas
df = pd.read_csv("random_flights_data.csv")

In [4]:
# Returns the first five rows of the dataframe
df.head()

# Pass a number as parameter to get that many rows from the top
# `df.head(10)` will return 10 rows

   FlightID           Airline Destination  Duration  Delay
0         1  American Airline     Sharjah       330     18
1         2      Tata Airline      Lahore       320     17
2         3               PIA  Washington       297     93
3         4     Japan Airways      Alaska       199     84
4         5     Japan Airways      Medina       146      2

In [5]:
# Similar to head(), tail() returns the last five rows of the dataframe
df.tail()

    FlightID           Airline Destination  Duration  Delay
95        96  American Airline     Karachi       174     53
96        97               PIA     Colombo       346     11
97        98     Saudi Airline       Mecca        89      4
98        99  American Airline      Riyadh       301     39
99       100     Japan Airways    Auckland       349     92

In [6]:
# Similar to head(), tail() returns the last five rows of the dataframe
df.tail()

    FlightID           Airline Destination  Duration  Delay
95        96  American Airline     Karachi       174     53
96        97               PIA     Colombo       346     11
97        98     Saudi Airline       Mecca        89      4
98        99  American Airline      Riyadh       301     39
99       100     Japan Airways    Auckland       349     92

## Perform operations on the data

In [7]:

# Example: Calculate the average duration and delay for each airline
average_stats = df.groupby("Airline")[["Duration", "Delay"]].mean()
display(average_stats)

display(f"Max Delay: {average_stats['Delay'].max()} minutes")
display(f"Max Duration: {average_stats['Duration'].max()} minutes")

                    Duration      Delay
Airline
American Airline  265.166667  50.777778
Emirates          226.500000  61.700000
Japan Airways     228.526316  55.736842
PIA               227.125000  64.312500
Qatar Airways     170.000000  65.875000
Saudi Airline     213.500000  45.500000
Tata Airline      215.444444  68.555556

'Max Delay: 68.55555555555556 minutes'

'Max Duration: 265.1666666666667 minutes'

In [8]:
max_delay_airline = average_stats["Delay"].idxmax()
max_duration_airline = average_stats["Duration"].idxmax()

display(f"Airline with the maximum average delay: {max_delay_airline}")
display(f"Airline with the maximum average duration: {max_duration_airline}")

'Airline with the maximum average delay: Tata Airline'

'Airline with the maximum average duration: American Airline'

In [9]:
df.info(verbose=False) # Provides a concise summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Columns: 5 entries, FlightID to Delay
dtypes: int64(3), object(2)
memory usage: 4.0+ KB

In [10]:
display(f"Columns: {df.columns}")
display(f"Keys: {df.keys()}")
display(f"Index: {df.index}")
display(f"Values: {df.values}")
display(f"Shape: {df.shape}")
display(f"Length: {len(df)}")
display(f"Size: {df.size}")
display(f"Data types: {df.dtypes}")
display(f"Memory usage: {df.memory_usage()}")

"Columns: Index(['FlightID', 'Airline', 'Destination', 'Duration', 'Delay'], dtype='object')"

"Keys: Index(['FlightID', 'Airline', 'Destination', 'Duration', 'Delay'], dtype='object')"

'Index: RangeIndex(start=0, stop=100, step=1)'

"Values: [[1 'American Airline' 'Sharjah' 330 18]\n [2 'Tata Airline' 'Lahore' 320 17]\n [3 'PIA' 'Washington' 297 93]\n [4 'Japan Airways' 'Alaska' 199 84]\n [5 'Japan Airways' 'Medina' 146 2]\n [6 'Japan Airways' 'Medina' 169 69]\n [7 'Qatar Airways' 'Dubai' 244 101]\n [8 'Japan Airways' 'Delhi' 76 12]\n [9 'Tata Airline' 'Medina' 212 44]\n [10 'Emirates' 'Dhaka' 209 117]\n [11 'American Airline' 'Riyadh' 170 66]\n [12 'Saudi Airline' 'Dubai' 85 111]\n [13 'PIA' 'Washington' 177 91]\n [14 'PIA' 'Medina' 143 85]\n [15 'American Airline' 'San Francisco' 221 39]\n [16 'Emirates' 'Dubai' 288 39]\n [17 'Qatar Airways' 'Delhi' 311 75]\n [18 'Saudi Airline' 'Karachi' 181 22]\n [19 'Saudi Airline' 'Mecca' 347 30]\n [20 'PIA' 'Karachi' 73 17]\n [21 'Qatar Airways' 'Dubai' 244 70]\n [22 'Tata Airline' 'Alaska' 212 71]\n [23 'Qatar Airways' 'Riyadh' 139 18]\n [24 'Tata Airline' 'Karachi' 101 92]\n [25 'PIA' 'Sharjah' 334 43]\n [26 'Qatar Airways' 'Alaska' 100 83]\n [27 'American Airline' 'Dubai' 267 49]\n [28 'Japan Airways' 'Lahore' 327 41]\n [29 'PIA' 'Medina' 226 93]\n [30 'Japan Airways' 'Dhaka' 171 46]\n [31 'Tata Airline' 'Washington' 189 21]\n [32 'Saudi Airline' 'Dubai' 283 73]\n [33 'PIA' 'Sharjah' 276 89]\n [34 'Emirates' 'Karachi' 84 114]\n [35 'Japan Airways' 'Mumbai' 127 96]\n [36 'PIA' 'Sharjah' 319 91]\n [37 'Qatar Airways' 'Washington' 294 73]\n [38 'Japan Airways' 'Lahore' 264 28]\n [39 'Tata Airline' 'Mumbai' 351 107]\n [40 'Japan Airways' 'Karachi' 274 81]\n [41 'Japan Airways' 'Dhaka' 249 105]\n [42 'Saudi Airline' 'Karachi' 257 58]\n [43 'PIA' 'San Francisco' 275 0]\n [44 'Qatar Airways' 'Riyadh' 103 86]\n [45 'Qatar Airways' 'San Francisco' 92 63]\n [46 'Qatar Airways' 'Mumbai' 71 16]\n [47 'PIA' 'Riyadh' 164 106]\n [48 'Emirates' 'Karachi' 272 36]\n [49 'American Airline' 'San Francisco' 198 94]\n [50 'Japan Airways' 'Riyadh' 242 24]\n [51 'Saudi Airline' 'Mecca' 185 116]\n [52 'Japan Airways' 'Delhi' 216 63]\n [53 'Emirates' 'Karachi' 171 67]\n [54 'American Airline' 'Mumbai' 318 51]\n [55 'Emirates' 'San Francisco' 87 8]\n [56 'PIA' 'Dhaka' 277 56]\n [57 'PIA' 'Sharjah' 211 91]\n [58 'American Airline' 'Delhi' 234 93]\n [59 'Tata Airline' 'Mecca' 208 110]\n [60 'Tata Airline' 'Sharjah' 89 87]\n [61 'Saudi Airline' 'Kuwait' 127 32]\n [62 'PIA' 'Mumbai' 95 19]\n [63 'American Airline' 'Colombo' 355 72]\n [64 'Qatar Airways' 'Mumbai' 133 71]\n [65 'American Airline' 'Karachi' 357 87]\n [66 'Qatar Airways' 'Riyadh' 278 13]\n [67 'Emirates' 'Dubai' 319 58]\n [68 'Emirates' 'Dubai' 347 81]\n [69 'PIA' 'Kuwait' 325 116]\n [70 'Qatar Airways' 'Dubai' 87 55]\n [71 'Qatar Airways' 'Kuwait' 259 64]\n [72 'Qatar Airways' 'Riyadh' 121 75]\n [73 'Qatar Airways' 'San Francisco' 104 92]\n [74 'Japan Airways' 'Sharjah' 350 36]\n [75 'Saudi Airline' 'Riyadh' 148 25]\n [76 'Japan Airways' 'Colombo' 93 32]\n [77 'Saudi Airline' 'Auckland' 193 42]\n [78 'Emirates' 'Colombo' 292 14]\n [79 'Japan Airways' 'Alaska' 315 86]\n [80 'PIA' 'San Francisco' 96 28]\n [81 'Saudi Airline' 'Colombo' 316 20]\n [82 'Japan Airways' 'Alaska' 350 82]\n [83 'Tata Airline' 'Karachi' 257 68]\n [84 'American Airline' 'Riyadh' 314 22]\n [85 'Qatar Airways' 'San Francisco' 140 99]\n [86 'Emirates' 'Karachi' 196 83]\n [87 'American Airline' 'Mumbai' 249 7]\n [88 'Japan Airways' 'Alaska' 189 72]\n [89 'American Airline' 'Dubai' 269 61]\n [90 'Saudi Airline' 'Colombo' 351 13]\n [91 'American Airline' 'Colombo' 228 5]\n [92 'American Airline' 'Riyadh' 352 0]\n [93 'Japan Airways' 'Washington' 236 8]\n [94 'American Airline' 'Colombo' 85 79]\n [95 'American Airline' 'Sharjah' 351 79]\n [96 'American Airline' 'Karachi' 174 53]\n [97 'PIA' 'Colombo' 346 11]\n [98 'Saudi Airline' 'Mecca' 89 4]\n [99 'American Airline' 'Riyadh' 301 39]\n [100 'Japan Airways' 'Auckland' 349 92]]"

'Shape: (100, 5)'

'Length: 100'

'Size: 500'

'Data types: FlightID        int64\nAirline        object\nDestination    object\nDuration        int64\nDelay           int64\ndtype: object'

'Memory usage: Index          132\nFlightID       800\nAirline        800\nDestination    800\nDuration       800\nDelay          800\ndtype: int64'

In [11]:
df.describe() # Generates descriptive statistics of the dataframe

         FlightID    Duration       Delay
count  100.000000  100.000000  100.000000
mean    50.500000  222.350000   58.360000
std     29.011492   89.210496   33.702058
min      1.000000   71.000000    0.000000
25%     25.750000  145.250000   27.250000
50%     50.500000  227.000000   63.500000
75%     75.250000  298.000000   86.250000
max    100.000000  357.000000  117.000000

In [12]:
display(df['Airline'].value_counts()) # Returns the count of unique values in the 'Airline' column
print(f"Display max value in each column: {df[['Airline','Destination','Delay','Duration']]}") # Returns the maximum value in each column

Airline
Japan Airways       19
American Airline    18
PIA                 16
Qatar Airways       16
Saudi Airline       12
Emirates            10
Tata Airline         9
Name: count, dtype: int64

Display max value in each column:              Airline Destination  Delay  Duration
0   American Airline     Sharjah     18       330
1       Tata Airline      Lahore     17       320
2                PIA  Washington     93       297
3      Japan Airways      Alaska     84       199
4      Japan Airways      Medina      2       146
..               ...         ...    ...       ...
95  American Airline     Karachi     53       174
96               PIA     Colombo     11       346
97     Saudi Airline       Mecca      4        89
98  American Airline      Riyadh     39       301
99     Japan Airways    Auckland     92       349

[100 rows x 4 columns]

### Conditional selection

In [13]:
df[df['Duration'] < 90] #Performing list comprehension on the dataframe

    FlightID           Airline    Destination  Duration  Delay
7          8     Japan Airways          Delhi        76     12
11        12     Saudi Airline          Dubai        85    111
19        20               PIA        Karachi        73     17
33        34          Emirates        Karachi        84    114
45        46     Qatar Airways         Mumbai        71     16
54        55          Emirates  San Francisco        87      8
59        60      Tata Airline        Sharjah        89     87
69        70     Qatar Airways          Dubai        87     55
93        94  American Airline        Colombo        85     79
97        98     Saudi Airline          Mecca        89      4

In [14]:
# Selecting columns based on data types
df.select_dtypes('int') # Selects columns with numeric data types

    FlightID  Duration  Delay
0          1       330     18
1          2       320     17
2          3       297     93
3          4       199     84
4          5       146      2
..       ...       ...    ...
95        96       174     53
96        97       346     11
97        98        89      4
98        99       301     39
99       100       349     92

[100 rows x 3 columns]

## Filtering rows

The `loc` and the `iloc` method

In [15]:

df.iloc[1,3], df.loc[1,'Duration']

(320, 320)

In [16]:
df.loc[
    2:6, "Airline":"Duration"
]  # Selects rows 2 to 6 and columns 'Airline' to 'Duration'

         Airline Destination  Duration
2            PIA  Washington       297
3  Japan Airways      Alaska       199
4  Japan Airways      Medina       146
5  Japan Airways      Medina       169
6  Qatar Airways       Dubai       244

In [17]:
df.iloc[0:5, 2:5] # Selecting a subset of the dataframe

  Destination  Duration  Delay
0     Sharjah       330     18
1      Lahore       320     17
2  Washington       297     93
3      Alaska       199     84
4      Medina       146      2

### Filtering using `query` method

In [18]:
df.query("Duration > 300")

    FlightID           Airline Destination  Duration  Delay
0          1  American Airline     Sharjah       330     18
1          2      Tata Airline      Lahore       320     17
16        17     Qatar Airways       Delhi       311     75
18        19     Saudi Airline       Mecca       347     30
24        25               PIA     Sharjah       334     43
27        28     Japan Airways      Lahore       327     41
35        36               PIA     Sharjah       319     91
38        39      Tata Airline      Mumbai       351    107
53        54  American Airline      Mumbai       318     51
62        63  American Airline     Colombo       355     72
64        65  American Airline     Karachi       357     87
66        67          Emirates       Dubai       319     58
67        68          Emirates       Dubai       347     81
68        69               PIA      Kuwait       325    116
73        74     Japan Airways     Sharjah       350     36
78        79     Japan Airways      Alaska       315     86
80        81     Saudi Airline     Colombo       316     20
81        82     Japan Airways      Alaska       350     82
83        84  American Airline      Riyadh       314     22
89        90     Saudi Airline     Colombo       351     13
91        92  American Airline      Riyadh       352      0
94        95  American Airline     Sharjah       351     79
96        97               PIA     Colombo       346     11
98        99  American Airline      Riyadh       301     39
99       100     Japan Airways    Auckland       349     92

In [26]:
# Multiple conditions

df.query(("Duration > 300") and ("Delay < 30"))

    FlightID           Airline    Destination  Duration  Delay
0          1  American Airline        Sharjah       330     18
1          2      Tata Airline         Lahore       320     17
4          5     Japan Airways         Medina       146      2
7          8     Japan Airways          Delhi        76     12
17        18     Saudi Airline        Karachi       181     22
19        20               PIA        Karachi        73     17
22        23     Qatar Airways         Riyadh       139     18
30        31      Tata Airline     Washington       189     21
37        38     Japan Airways         Lahore       264     28
42        43               PIA  San Francisco       275      0
45        46     Qatar Airways         Mumbai        71     16
49        50     Japan Airways         Riyadh       242     24
54        55          Emirates  San Francisco        87      8
61        62               PIA         Mumbai        95     19
65        66     Qatar Airways         Riyadh       278     13
74        75     Saudi Airline         Riyadh       148     25
77        78          Emirates        Colombo       292     14
79        80               PIA  San Francisco        96     28
80        81     Saudi Airline        Colombo       316     20
83        84  American Airline         Riyadh       314     22
86        87  American Airline         Mumbai       249      7
89        90     Saudi Airline        Colombo       351     13
90        91  American Airline        Colombo       228      5
91        92  American Airline         Riyadh       352      0
92        93     Japan Airways     Washington       236      8
96        97               PIA        Colombo       346     11
97        98     Saudi Airline          Mecca        89      4

### Unique values

In [30]:
display(df['Airline'].unique()) # Returns the unique values in the 'Airline' column

df['Airline'].nunique() # Returns the number of unique values in the 'Airline' column

array(['American Airline', 'Tata Airline', 'PIA', 'Japan Airways',
       'Qatar Airways', 'Emirates', 'Saudi Airline'], dtype=object)

7

In [33]:
display(df['Airline'].value_counts())

# Returns the frequency of each unique value in the 'Airline' column
df['Airline'].value_counts(normalize=True)

Airline
Japan Airways       19
American Airline    18
PIA                 16
Qatar Airways       16
Saudi Airline       12
Emirates            10
Tata Airline         9
Name: count, dtype: int64

Airline
Japan Airways       0.19
American Airline    0.18
PIA                 0.16
Qatar Airways       0.16
Saudi Airline       0.12
Emirates            0.10
Tata Airline        0.09
Name: proportion, dtype: float64